app/controllers/sessions_controller.rb

  def create
    user = User.find_by_id(params[:id]) #Finds the user by the user id
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1